app/views/favorites/_favorite.html.erb

  <%= link_to review_favorites_path(review), method: :delete, remote: true do %>
    ♥ <%= review.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."review_id" = ?  [["review_id", 1]]

  <%=link_to review_favorites_path(review), method: :post, remote: true do %>
    ♡ <%= review.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."review_id" = ?  [["review_id", 1]]