app/views/users/favorites.html.erb

          <td>
            <% user=User.find(review.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]