app/views/homes/top.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."review_id" = ?  [["review_id", 1]]
---
          <p><%= review.tittle %><br>
             お気に入り数：<%= review.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."review_id" = ?  [["review_id", 1]]
---
          <p><%= review.tittle %><br>
             お気に入り数：<%= review.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."review_id" = ?  [["review_id", 1]]
---
          <p><%= review.tittle %><br>
             お気に入り数：<%= review.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."review_id" = ?  [["review_id", 1]]
---
          <p><%= review.tittle %><br>
             お気に入り数：<%= review.favorites.count %>

SELECT "reviews"."id" FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 2]]
---
        <p>ユーザーネーム：<%= user.name %></p>
        <p>総投稿数<%= user.reviews.count %></p>