app/controllers/favorites_controller.rb

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "review_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["review_id", 11], ["created_at", "2022-02-27 10:41:46.843300"], ["updated_at", "2022-02-27 10:41:46.843300"]]
---
  def create
    @review=Review.find(params[:review_id])
    review=Review.find(params[:review_id])
    favorite=current_user.favorites.new(review_id: review.id)
    favorite.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."review_id" = ? LIMIT ?  [["user_id", 2], ["review_id", 12], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 7]]
---
  def destroy
    @review=Review.find(params[:review_id])
    review=Review.find(params[:review_id])
    favorite=current_user.favorites.find_by(review_id: review.id)
    favorite.destroy