app/controllers/homes_controller.rb

SELECT  "favorites"."review_id" FROM "favorites" WHERE "favorites"."created_at" BETWEEN ? AND ? GROUP BY "favorites"."review_id" ORDER BY count(review_id) desc LIMIT ?  [["created_at", "2022-03-01 00:00:00"], ["created_at", "2022-03-31 23:59:59.999999"], ["LIMIT", 3]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."review_id" IN (?, ?)  [["review_id", 11], ["review_id", 13]]
SELECT  "favorites"."review_id" FROM "favorites" WHERE "favorites"."created_at" BETWEEN ? AND ? GROUP BY "favorites"."review_id" ORDER BY count(review_id) desc LIMIT ?  [["created_at", "2022-02-28 00:00:00"], ["created_at", "2022-03-06 23:59:59.999999"], ["LIMIT", 3]]
SELECT  "favorites"."review_id" FROM "favorites" WHERE "favorites"."created_at" BETWEEN ? AND ? GROUP BY "favorites"."review_id" ORDER BY count(review_id) desc LIMIT ?  [["created_at", "2022-03-01 00:00:00"], ["created_at", "2022-03-01 23:59:59.999999"], ["LIMIT", 3]]
SELECT "users".* FROM "users"
---
  def top
    @review_ranks=Review.find(Favorite.group(:review_id).order("count(review_id) desc").limit(3).pluck(:review_id))
    @month_review_ranks=Review.find(Favorite.group(:review_id).where(created_at: Time.current.all_month).order("count(review_id) desc").limit(3).pluck(:review_id))
    @week_review_ranks=Review.find(Favorite.group(:review_id).where(created_at: Time.current.all_week).order("count(review_id) desc").limit(3).pluck(:review_id))
    @day_review_ranks=Review.find(Favorite.group(:review_id).where(created_at: Time.current.all_day).order("count(review_id) desc").limit(3).pluck(:review_id))
    review_favorite_count={}
    User.all.each do |user|