app/controllers/reviews_controller.rb

SELECT  "reviews".* FROM "reviews" ORDER BY created_at DESC LIMIT ?  [["LIMIT", 11]]
SELECT COUNT(*) FROM "reviews"
---
  def index
    @reviews=Review.order(created_at: :desc).page(params[:page])

INSERT INTO "reviews" ("user_id", "tittle", "genre_id", "introduction", "created_at", "updated_at", "game_tittle", "star", "play_time_id", "price_id", "plat_form_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @review=Review.new(review_params)
    @review.user_id=current_user.id
    if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "reviews" SET "tittle" = ?, "genre_id" = ?, "introduction" = ?, "play_time_id" = ?, "star" = ?, "price_id" = ?, "game_tittle" = ?, "plat_form_id" = ?, "updated_at" = ? WHERE "reviews"."id" = ?
---
  def update
    @review=Review.find(params[:id])
    if @review.update(review_params)

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 5]]
---
  def destroy
    @review=Review.find(params[:id])
    if @review.destroy