app/controllers/users_controller.rb

  def show
    @user=User.find(params[:id])
    @reviews=@user.reviews.page(params[:page]).reverse_order
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ? ORDER BY "reviews"."id" DESC LIMIT ? OFFSET ?  [["user_id", 2], ["LIMIT", 25], ["OFFSET", 0]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def update
    @user=current_user
		if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "田中MAX"], ["introduction", "aaaaa"], ["updated_at", "2022-03-02 05:25:45.302380"], ["id", 6]]

  def favorites
    @user=User.find(params[:id])
    favorites=Favorite.where(user_id: @user.id).pluck(:review_id)
    @favorite_reviews=Review.find(favorites)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "favorites"."review_id" FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", 2]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" IN (?, ?, ?)  [["id", 1], ["id", 2], ["id", 3]]