app/views/reviews/index.html.erb

          <td>
            <% user=User.find(review.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]